ch6/ch6-4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-28 Fri 10:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 6.4</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 6.4</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge03bca8">ch6.4</a>
<ul>
<li><a href="#org0952316">6.4-1</a></li>
<li><a href="#org5591bb6">6.4-2</a></li>
<li><a href="#orgf3af51f">6.4-3</a></li>
<li><a href="#org23d3a16">6.4-4</a></li>
<li><a href="#orgde0216b">6.4-5</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge03bca8" class="outline-2">
<h2 id="orge03bca8">ch6.4</h2>
<div class="outline-text-2" id="text-orge03bca8">
</div>
<div id="outline-container-org0952316" class="outline-3">
<h3 id="org0952316">6.4-1</h3>
<div class="outline-text-3" id="text-org0952316">
<pre class="example">
   (5 13 2 25 7 17 20 8 4)
-&gt; ((25 (13 (8 (5) (4)) (7)) (20 (17) (2))))    # BUILD-MAX-HEAP
-&gt; ((4 (13 (8 (5)) (7)) (20 (17) (2))) 25)
-&gt; ((20 (13 (8 (5)) (7)) (17 (4) (2))) 25)
-&gt; ((5 (13 (8) (7)) (17 (4) (2))) 20 25)
-&gt; ((17 (13 (8) (7)) (5 (4) (2))) 20 25)
-&gt; ((2 (13 (8) (7)) (5 (4))) 17 20 25)
-&gt; ((13 (8 (2) (7)) (5 (4))) 17 20 25)
-&gt; ((4 (8 (2) (7)) (5)) 13 17 20 25)
-&gt; ((8 (7 (2) (4)) (5)) 13 17 20 25)
-&gt; ((4 (7 (2)) (5)) 8 13 17 20 25)
-&gt; ((7 (4 (2)) (5)) 8 13 17 20 25)
-&gt; ((2 (4) (5)) 7 8 13 17 20 25)
-&gt; ((5 (4) (2)) 7 8 13 17 20 25)
-&gt; ((2 (4)) 5 7 8 13 17 20 25)
-&gt; ((4 (2)) 5 7 8 13 17 20 25)
-&gt; ((2) 4 5 7 8 13 17 20 25)
-&gt; (2 4 5 7 8 13 17 20 25)
</pre>
</div>
</div>
<div id="outline-container-org5591bb6" class="outline-3">
<h3 id="org5591bb6">6.4-2</h3>
<div class="outline-text-3" id="text-org5591bb6">
<p>
<b>Initialization:</b> A[1..n] is a max heap contains the \(n\) smallest elements,
A[n+1..n] is empty.
</p>

<p>
<b>Maintenance:</b> At the start of ith iteration, A[1] is the root of the max
heap A[1..i] which contains the \(i\) smallest elements of A[1..n], thus A[1]
is the ith largest element, and A[i+1..n] contains the \(n-i\) largest
elements of A[1..n] and is sorted, after we exchange A[1] with A[i], A[i..n]
contains the \(n-i+1\) largest elements of A[1..n] and is sorted, and the
A[1..i-1] is a max heap besides A[1], then we perform MAX-HEAPIFY on A[1],
after that A[1..i-1] becomes a max heap containing the \(i-1\) smallest
elements of A[1..n].
</p>

<p>
<b>Termination:</b> The procedure terminates when \(i=1\), A[1] is the smallest
element of A[1..n], and A[2..n] contains the \(n-1\) largest elements of
A[1..n] and is sorted, thus A[1..n] is the sorted permutation of the input
array A.
</p>
</div>
</div>

<div id="outline-container-orgf3af51f" class="outline-3">
<h3 id="orgf3af51f">6.4-3</h3>
<div class="outline-text-3" id="text-orgf3af51f">
<p>
Both of them have \(\Theta(n\lg n)\) running time, the BUILD-MAX-HEAP costs
\(O(n)\) running time, and the sort loop costs \(\Theta(n\lg n)\) running
time.
</p>
</div>
</div>
<div id="outline-container-org23d3a16" class="outline-3">
<h3 id="org23d3a16">6.4-4</h3>
<div class="outline-text-3" id="text-org23d3a16">
<p>
If A is already sorted in decreasing order, then each MAX-HEAPIFY in the sort
loop will keep moving the root element till the bottom of the heap, thus the
running time of the sort loop is
</p>
\begin{align*}
T(n)
&=\sum_{i=1}^{n-1}(\Theta(1)+\Theta(\lfloor \lg(n-i)\rfloor))\\
&\geq \Omega(\sum_{i=1}^{n-1}(\lg(i/2)))+\Omega(n)\\
&=\Omega(n\lg n)
\end{align*}
</div>
</div>
<div id="outline-container-orgde0216b" class="outline-3">
<h3 id="orgde0216b">6.4-5</h3>
<div class="outline-text-3" id="text-orgde0216b">
<p>
The BUILD-MAX-HEAP has linear running time, so we just need to analyze the
runnig time of the sort loop.
</p>

<p>
Assume there are \(2^k - 1\) elements, then the max heap is a height \(k\)
complete heap, we mark the nodes from top to bottom as level \(1\) to \(k\).
</p>

<p>
There are \(2^{k-1}\) nodes at \(k\) level, and obviously there are at most
\(2^{k-2}\) largest nodes at \(k\) level, thus there are at least
\(2^{k-2} - 1\) large nodes at \(1\) to \(k - 1\) levels, and there are
totally \(2^{k-3} - 1\) nodes at \(1\) to \(k - 3\) levels, so there are at
least \(2^{k-3}\) large nodes at \(k - 2\) or \(k - 3\) level, these nodes
need totally at least \(2^{k-3}(k-3)\) moves to get to the top, the running
time is \(\Omega(n\lg n)\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-08-28 Fri 10:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
